<?php


$test = 5; // поменяем значение на отриц

if ($test > 10){ //задание больше 10№1    №2меньше <10  №3 больше или равна 10>=  #4 меньше или равна 10 <=
    echo '+++<br>';
}else{
    echo '___<br>'; // сработает это
}

//Проверка на равенство в PHP
$test1 = 0; // пусть значение переменной равно 0

if ($test1 == 10){  // сработает это, так как переменная равна 0  №1  Проверьте то, что переменная $test равна 10.
    echo '+++<br>';
}else{// можно и поставить 1 чтоб сработало ___ так как не равна 0 будет
    echo '___<br>';
}



//Проверка на неравенство в PHP
$test = 1; // пусть значение переменной равно 1

if ($test != 0) {   //Проверьте то, что переменная $test не равна 10. №1
    echo '+++<br>'; // сработает это, так как переменная НЕ равна 0
} else {
    echo '---<br>';
}


//Сравнение переменных в PHP
$test1 = 2000;
$test2 = 100000;

if ($test2 > $test1) {
    echo '+++<br>'; // сработает это, так как $test2 больше $test1
} else {
    echo '---<br>';
}

//Типы данных и конструкция if-else в PHP
$test = 'xui';

if ($test == 'xui') {
    echo '+++<br>'; // сработает это, так как переменная равна 'abc'
} else {
    echo '---<br>';
}

//Числа в кавычках в PHP
if ('3' == 4) {
    echo '+++<br>'; // сработает это - значения равны
} else {
    echo '---<br>';
}


//Равенство по значению и типу в PHP

if (3 === 3) {
    echo '+++<br>'; // сработает это
} else {
    echo '---<br>';
}

if (2 === 3) {
    echo '+++<br>';
} else {
    echo '---<br>'; // сработает это
}


//Неравенство по значению и типу в PHP

//Кроме оператора != существует также оператор !==, учитывающий тип при сравнении. Давайте рассмотрим различия между ними на примерах.
//
//Пусть с помощью оператора != сравниваются два числа 3. Данный оператор сравнивает значения на то, что они НЕ равны.
// Так как наши значения как раз-таки равны,
// то на экран выведется '-':
$test1 = '3';
$test2 = '3';

if ($test1 != $test2) {
    echo '+++<br>';
} else {
    echo '---<br>';
}


$test11 = '3';
$test22 = '3';

if ($test11 !== $test22) {
    echo '+++<br>';
} else {
    echo '---<br>';
}

//Логическое И в PHP
$num = 3;
//
if ($num > 0 and $num <5 ){ //№1 больше нуля и меньше 5
    echo '+++<br>';
}else {
    echo '---<br>';
}
//Проверьте то, что переменная $num больше или равна 10 и меньше или равна 20.
$num = 10;
if ($num >= 10 and $num <=5 ){
    echo '+++<br>';
}else {
    echo '---<br>';
}

$num12 = 2;
$num23 = 3;

if ($num12 <= 1 and $num23 >= 3) { //№3
    echo '+++<br>';
} else {
    echo '---<br>';
}
//Логическое ИЛИ в PHP
$num1 = -10;
$num2 = -10;

if ($num1 >= 0 or $num2 >= 0) {
    echo '+++<br>';
} else {
    echo '---<br>';
}
//Группировка условий в PHP
//№1
$num100 = 3;
if (($num100 > 5 and $num100 < 10) or ($num100 == 20)) {
    echo '+++<br>';
} else {
    echo '---<br>';
}

//№2
$num = 3;
if (($num > 5) or ($num > 0 and $num < 3)) {
    echo '+++<br>';
} else {
    echo '---<br>';
}

//№3
$num = 3;
if (($num == 9) or ($num > 10 and $num < 20 or $num > 20 and $num < 30)) {
    echo '+++<br>';
} else {
    echo '---<br>';
}
//Инвертирование высказываний в if-else №1
if (!($num1 >= 0 or $num2 <= 10)) {
    echo '+++<br>';
} else {
    echo '---<br>';
}

//Конструкция if-else и булевы значения
$test = true;

if ($test === true) { //№2 роверьте то, что переменная $test равна false.

    echo '+++<br>';
} else {
    echo '---<br>';
}

//Нестрогое сравнение логических значений в PHP
$test = 1;

if ($test == true) {
    echo '+++<br>'; // сработает это, тк 1 == true - это верно
} else {
    echo '---<br>';// сработает это, тк 0 == true - это НЕверно
}

//Сокращенный if в конструкции if-else
//№1
$test = true;
if ($test){
    echo '+++<br>';
}else{
    echo '---<br>';
}

$text = true;
if (!$text) {
    echo '+++<br>';
}else{
    echo '---<br>';
}

$test = true;
if (!$test){
    echo '+++<br>';
}else {
    echo '---<br>';
}

$test = true;
if ($test){
    echo '+++<br>';
}else {
    echo '---<br>';
}

//Команда isset в PHP
//№1
$test = null;
if (isset ($test)){
    echo '+++<br>';
}else {
    echo '---<br>';
}
//№2
$test = null;
if (!isset($test)){
    echo '+++<br>';
}else {
    echo '---<br>';
}

//Команда empty в PHP
//Зачастую в скриптах возникает нужда в проверке переменной на пустоту. В PHP переменная будет пустая,
// если она равна 0, '', '0', false или null.
$test = '';

if (empty($test)) { //так же инвертировать и поставить !
    echo '+++<br>';
} else {
    echo '---<br>';
}

//Необязательность команды else в PHP
//№1
$test = 10;

if ($test == 1) {
    echo '+++';
}

//Проблема необязательности фигурных скобок в условиях в PHP

$num = 5;

if ($num === 5) {
    echo $num;
    echo '+++';
}


//Комбинации конструкций if-else в PHP №1

$day = 15;

if ($day >= 1 and $day <= 10) {
    echo '1 декада';
} elseif ($day >= 11 and $day <= 20) {
    echo '2 декада';
} else {
    echo '3 декада';
}

?>
